<?php

$arrayObl = [                   
    'Московская' => [         
        'Москва',                 
        'Зеленоград',         
        'Клин<hr>'                  
    ],
    'Ленинградская' => [      
        'Санкт-Петербург',
        'Всеволожск',
        'Павловск',
        'Кронштадт<hr>'
    ],
    'Рязанская' => [
        'Рязань',
        'Касимов',
        'Шацк'
    ]
];
 
 
foreach ($arrayObl as $obl => $city) {     
    echo $obl  . "&nbsp область: <br>";                  
    foreach ($city as $cityName) {          
        echo  "&nbsp г." .  $cityName . "<br>"; 
    }
}

?>           